PR:
```
        new file:   modules/20-partner-interconnect/main.tf
        new file:   modules/20-partner-interconnect/outputs.tf
        new file:   modules/20-partner-interconnect/variables.tf
```

```
Step #3 - "tf plan": Terraform will perform the following actions:
Step #3 - "tf plan": 
Step #3 - "tf plan":   # module.partner-interconnect-primary.google_compute_router.router1 will be created
Step #3 - "tf plan":   + resource "google_compute_router" "router1" {
Step #3 - "tf plan":       + creation_timestamp = (known after apply)
Step #3 - "tf plan":       + id                 = (known after apply)
Step #3 - "tf plan":       + name               = "router-1"
Step #3 - "tf plan":       + network            = "tzpecnr-nonprod-svpc-vpc"
Step #3 - "tf plan":       + project            = "tzpe-tlz-tlz-np2"
Step #3 - "tf plan":       + region             = "northamerica-northeast1"
Step #3 - "tf plan":       + self_link          = (known after apply)
Step #3 - "tf plan": 
Step #3 - "tf plan":       + bgp {
Step #3 - "tf plan":           + advertise_mode = "DEFAULT"
Step #3 - "tf plan":           + asn            = 16550
Step #3 - "tf plan":         }
Step #3 - "tf plan":     }
```